Autodesk.Revit.DB.ICloudExternalServerProxy.GetRegions
Gets all available regions that are supported by the cloud service.
Returns:
The list of regions.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.GetProjects(System.String,System.String)
Gets all projects that are available to current login user from this Hub.
hubId:
Hub identity in ForgeDM.
region:
The Hub/Cloud Model's account and project region.
Returns:
The list of Projects. Returns an empty list if there is no project in this Hub.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.GetCloudModelInfo(System.Boolean,System.String,System.Guid,System.Guid,System.String@,System.String@,System.String@,System.String@,System.String@,System.String@)
Gets the cloud model and related forge infomation.
forceToTraverse:
Force use trasverse mode to skip off entitlement check, but with bad performance.
region:
The Cloud Model account and project region.
projectGUID:
The GUID of the cloud project which contains the model.
modelGUID:
The GUID of the Revit cloud model.
hubId:
Cloud Model account id.
projectId:
Project identity in Autodesk Project.
projectName:
The name of the cloud project which contains the model as returned value.
folderUrn:
Folder identity in Autodesk Project.
modelUrn:
Model identity in Autodesk Project.
modelName:
The name of the Revit cloud model as returned value.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.HasCloudModelAccounts
Indicates if the current login user has any Cloud Model's accounts or not.
Returns:
Returns true if this ADSK account associated one or more Cloud Model's accounts, otherwise returns false.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.GetCloudGUIDsByCloudModelInfo(System.String,System.String,System.String,System.String)
Gets RCM project GUID and model GUID from project id, folder id and model name.
Remarks:
Will be replaced by CloudModel in future.
CloudModel means the data comes from forgeDM.
region:
The Cloud Model account and project region.
projectId:
Project identity in Autodesk Project.
folderId:
Folder identity in Autodesk Project.
modelName:
Specifies the model name in Autodesk Project to save the model.
Returns:
Returns a map including RCM project and model GUID.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.GetProjectInfoFromFolderLocationInformation(System.String,System.String,Autodesk.Revit.CloudProjectInfo)
accountId:
The Cloud Model account Id.
projectId:
The Cloud Model project Id.
data:
Cloud external data as output.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.IsValidUrn(System.String)
check if the uri string represents a valid URN.
uri:
Folder or model identity in Autodesk Project.
Returns:
Returns true if the uri string represents a valid URN,
which also means it follows the prescribed format.
Since:
2019